{
  "ex1": "---\n## #1 **Calculadora flex**\n\nO programa recebe como entrada três linhas:\n- a primeira pode conter um entre os seguintes valores: + - * / // % **\n- as duas linhas seguintes contêm um inteiro cada\n\nA saída é uma linha com o resultado da operação envolvendo os dois valores inteiros dados\n\n**Exemplo**\n\n*Você digita:*\n```\n+\n5\n5\n```\n\n*O programa imprime:*\n```\n10\n```\n",
  "ex2": "---\n## #2 **A Compra Responsável**\n\nUma pessoa está fazendo uma compra por um site Web. Ela colocou um conjunto de itens no carrinho de compras, e vai pagar a compra com PIX.\n> Essa pessoa decidiu nunca gastar mais do ela realmente tem.\n\nSeu programa deve ler duas linhas, com um valor inteiro cada. O primeiro valor corresponde ao valor em dinheiro que a pessoa tem na conta do banco. O segundo valor corresponde ao total calculado no carrinho de compras.\n\n> Seu programa deve verificar se a pessoa pode ou não realizar a compra de modo a respeitar sua própria decisão, e emitir mensagens correspondentes:\n- se o saldo for suficiente, informar 'pode comprar tudo'\n- caso contrário, informar 'saldo insuficiente'\n\n**Exemplo**\n\n*Você digita:*\n```\n25\n5\n```\n\n*O programa imprime:*\n```\npode comprar tudo\n```\n\n*Você digita:*\n```\n5\n6\n```\n\n*O programa imprime:*\n```\nsaldo insuficiente\n```\n\n",
  "ex3": "---\n## #3 **A Compra Responsável Informada**\n\nUma pessoa está fazendo uma compra por um site Web. Ela colocou um conjunto de itens no carrinho de compras, e vai pagar a compra com PIX.\n\n> Essa pessoa decidiu nunca gastar mais do ela realmente tem.\n\nSeu programa deve ler duas linhas, com um valor inteiro cada.\n\n- o primeiro valor corresponde ao valor em dinheiro que a pessoa tem na conta do banco\n\n- o segundo valor corresponde ao total calculado no carrinho de compras.\n\nSeu programa deve verificar se a pessoa pode ou não realizar a compra de modo a respeitar sua própria decisão, e emitir mensagens correspondentes.\n\n- Caso a compra não deva ser efetuada para respeitar a decisão, informar 'seu saldo é insuficiente para essa compra'\n- Caso a compra possa ser efetuada respeitando a decisão, informar o novo saldo caso a compra seja de fato realizada\n\n**Exemplo #1**\n\n*Você digita:*\n```\n50\n20\n```\n\n*O programa imprime:*\n```\n30\n```\n\n**Exemplo #2**\n\n*Você digita:*\n```\n25\n30\n```\n\n*O programa imprime:*\n```\nseu saldo é insuficiente para essa compra\n\n```\n",
  "ex4": "---\n## #4 **Usando o teclado para jogar**\nAs teclas **A S W D** são parte importante de qualquer jogo que utilize o teclado.\n\n> (Quase) Todo mundo sabe que elas correspondem a teclas de direção e sentido.\n\nSeu programa deve ler um valor correspondente a uma tecla (como uma *string*, ou seja, usando diretamente o resultado da função `input()`)\n\nA seguir, seu programa deve identificar se o valor lido corresponde uma das teclas A S W D,  que podem ser digitadas com letra minúsculas ou maiúsculas.\n\n> Se for uma dessas teclas, informar qual é, em inglês e em letras maísculas\n- **w** e **W** produzem UP\n- **s** e **S** produzem DOWN\n- **a** e **A** produzem LEFT\n- **d** e **D** produzem RIGHT\n\nSe nao for uma das letras esperadas, seu programa responde com um ponto de interrogação\n\n**Exemplo #1**\n\n*Você digita:*\n```\na\n```\n\n*O programa imprime:*\n```\nLEFT\n```\n\n**Exemplo #2**\n\n*Você digita:*\n```\nU\n```\n\n*O programa imprime:*\n```\n?\n```\n",
  "ex5": "---\n## #5 **Melhor idade?**\nSeu programa deve ler um valor inteiro correspondente à idade de uma pessoa e, caso a idade seja igual ou maior que 60, **informar a idade seguida de 'Melhor idade!'**\n\nIndependentemente da idade lida, o programa deve concluir com a mensagem 'Fim'\n\n**Exemplo**\n\n*Você digita:*\n```\n64\n```\n\n*O programa imprime:*\n```\n64 Melhor idade!\nFim\n```\n",
  "ex6": "---\n## #6 **VV ou FF?**\n\nSeu programa deve receber duas strings, uma por linha.\n- Se ambas forem 'V', o programa deve exibir a resposta 'VV'\n- Se ambas as entradas forem 'F', o programa deve exibir a resposta 'FF'\n- Se nenhuma dessas condições for atendida, o programa deve exibir a resposta '?' para indicar uma resposta desconhecida.\n\n**Exemplo**\n\n*Você digita:*\n```\nV\nF\n```\n\n*O programa imprime:*\n```\n?\n```\n",
  "ex7": "---\n## #7 **Você dorme o suficiente? (OBRIGATÓRIO)**\n**Dormir bem é essencial para nossa sobrevivência!**\n\n> Peço que você assita a série TED \"Dormindo com Ciência\" do professor Matthew Walker, que atualmente trabalha na Universidade da Califórnia, Berkeley (EUA):\n- ele é especialista no impacto do sono na saúde humana\n- a recomendação geral é que todo adulto deve dormir pelo menos 8 horas por noite\n\n**A série TED \"Dormindo com Ciência\"**\n> A série tem duas temporadas com 8 episódios cada um. A primeira temporada tem vídeo de aproximadamente 4 minutos. Na segunda temporada, a maioria tem menos de dois minutos...\n- vale à pena mesmo, recomendo fortemente\n- [https://www.ted.com/series/sleeping_with_science](https://www.ted.com/series/sleeping_with_science)\n- você consegue colocar legenda em Portugues Brasileiro\n\n**O que seu programa deve fazer?**\n> Dada a enorme importância do sono, seu programa deve orientar um usuário adulto que informa quantas horas de sono teve na noite anterior.\n\n*Exemplos de entrada e saída para seu programa:*\n- 8.1 produz \"Você dormiu muito bem, parabéns!\"\n- 8 produz \"Você dormiu o suficiente, continue assim!\"\n- 7.9 produz \"Você precisa de mais tempo de sono, cuide-se!\"\n\n**Exemplo**\n\n*Você digita:*\n```\n8\n```\n\n*O programa imprime:*\n```\nVocê dormiu o suficiente, continue assim!\n```\n",
  "ex8": "---\n## #8 **Maior Menor (OBRIGATÓRIO)**\n> Atenção: para resolver este problema, você deve usar no máximo uma comparação básica (apenas um if-else)\n\nDados dois valores inteiros **diferentes**, sua tarefa é identificar qual é o maior e qual é o menor\n\n**Exemplo**\n\n*Você digita:*\n```\n10\n100\n```\n\n*O programa imprime:*\n```\nmaior 100\nmenor 10\n```\n",
  "ex9": "---\n## #9 **As idades de 3 irmãs usando apenas condicionais #1 (OBRIGATÓRIO)**\n*Este exercício nos convida a refletir  o quanto aprendermos quando realizamos uma única comparação e quando realizamos uma sequência de comparações*\n\nVocê deve ler a idade de **três irmãs**, uma por linha\n- e informar qual a mais velha\n\n\n**Exemplo**\n\n*Você digita:*\n```\n25\n27\n23\n```\n\n*O programa imprime:*\n```\nmaior 27\n```\n",
  "ex10": "---\n## #10 **As idades de 4 irmãs usando apenas condicionais #2 (OBRIGATÓRIO)**\n*Este exercício também nos convida a refletir  o quanto aprendermos quando realizamos uma única comparação e quando realizamos uma sequência de comparações*\n\nVocê deve ler a idade de **quatro irmãs**, uma por linha, e informar\n- qual a mais velha\n- qual a mais nova\n\n\n**Exemplo**\n\n*Você digita:*\n```\n2\n4\n1\n3\n```\n\n*O programa imprime:*\n```\nmaior 4\nmenor 1\n```\n",
  "ex11": "---\n## #11 **Valores Romanos**\n\nSeu programa deve ler uma letra e verificar a qual algarismo romano ela corresponde.\n- responda o valor correspondente se for uma das entradas: I, V, X, L, C, D, M\n- se o valor não for um dos avalores acima, informe como no exemplo\n\n\n**Exemplo #1**\n\n*Você digita:*\n```\nR\n```\n\n*O programa imprime:*\n```\nVocê não digitou um algarismo romano válido\n```\n\n**Exemplo #2**\n\n*Você digita:*\n```\nD\n```\n\n*O programa imprime:*\n```\n500\n```\n"
}
