{
  "ex9": "## Senha válida #3\n\nContinuamos tentando ajudar as pessoas a entenderem como fazer senhas melhores. Seu programa deve ler uma string em uma linha e verificar se a senha passa ou não pelo seu analisador de senhas. Para passar desta vez, a senha tem que ter pelo menos 8 caracteres, dos quais pelo menos um é um algarismo e pelo menos um é uma vogal (maiúscula ou minúscula).\n\n**Você digita**\n```\nçlkjhgfds\n```\n\n**Programa imprime**\n```\nVerifique algarismo e vogal\n```\n\n**Você digita**\n```\noie+afff\n```\n\n**Programa imprime**\n```\nVerifique algarismo\n```\n\n**Você digita**\n```\nxyz01zyz\n```\n\n**Programa imprime**\n```\nVerifique vogal\n```\n\n**Você digita**\n```\nxyz1Azyz\n```\n\n**Programa imprime**\n```\nOK!\n```",
  "ex10": "## Senha válida #4\n\nContinuamos tentando ajudar as pessoas a entenderem como fazer senhas melhores. Seu programa deve ler uma string em uma linha e verificar se a senha passa ou não pelo seu analisador de senhas. Para passar desta vez, a senha tem que ter pelo menos 8 caracteres, contendo pelo menos: um algarismo, uma vogal minúscula, uma vogal maiúscula e um entre os caracteres  `!@#$%&*+=`\n\n**Você digita**\n```\nAbcdef1+\n```\n\n**Programa imprime**\n```\nOK\n```\n\n**Você digita**\n```\nAbcdef123\n```\n\n**Programa imprime**\n```\nErro!\n```",
  "ex11": "## 11) Problema com pilhas\n\nSão inúmeros os problemas que podem ser causados pelo descarte incorreto de pilhas e baterias. São enormes os riscos para a saúde humana e para o meio ambiente, devido aos metais pesados tóxicos que contêm, como chumbo, mercúrio, cádmio e lítio, que contaminam o solo, a água e a cadeia alimentar, podendo causar doenças graves e danos neurológicos, renais e cardíacos.\n\nNa farmácia perto da sua escola tem uma caixa para o descarte correto de pilhas... infelizmente tem gente que coloca outras coisas na caixa.\n\nVocê tem que programar um robô para computar e separar os descartes. Se for pilha ou bateria, ele coloca em uma lista e ajusta o contador de descartes válidos. Se for outra coisa, ele coloca em outra lista e ajusta o contador de descartes inválidos. No final, o robô apresenta o total de cada categoria e as listas que ele montou.\n\nLeia itens (um por linha) até `.`. Classifique como *válido* se a linha contiver as palavras `pilha` ou `bateria`. Caso contrário, *inválido*. No final, imprima os totais e as listas.\n\n**Você digita**\n```\npilha AA\numa pilha AAA\npapel\npastico\nbateria 9V\n.\n```\n\n**Programa imprime**\n```\nvalidos: 3 ['pilha AA', 'uma pilha AAA', 'bateria 9V']\ninvalidos: 2 ['papel', 'pastico']\n```",
  "ex12": "## Pilhas de Pratos\n\nAs meninas da sua escola organizaram uma festa em que todo mundo leva um prato para contribuir. Para não dar confusão, cada prato tem o nome da dona escrito no fundo.\n\nNo final da festa, todo mundo ajuda na limpeza... as meninas se dividem entre limpar o chão, o banheiro, as mesas, e uma delas lava os pratos. As que tiram as mesas vão empilhando os pratos na pia da cozinha. A menina lavadora, ao terminar cada prato, chama a dona para pegar.\n\nSeu programa deve simular o processo de recebimento e entrega dos pratos. As entradas para o programa são linhas com o nome de uma menina (simulam a chegada de pratos), ou a string `lavando` (registra que um prato está sendo lavado e a dona deve ir buscar), ou a string `final feliz` (indica o fim dos pratos).\n\n**Você digita**\n```\nAna\nBeatriz\nlavando\nCarla\nlavando\nlavando\nfinal feliz\n```\n\n**Programa imprime**\n```\nlavando prato de Beatriz\nlavando prato de Carla\nlavando prato de Ana\n```"
}