{
  "ex1": "---\n## Exercício 1 — Contador A\n\nAs crianças da escola perto de sua casa estão aprendendo a contar e a professora pediu para você fazer um jogo para elas observarem uma contagem em ação.\n- Seu programa deve ler um valor inteiro positivo e imprimir, um por linha, os valores entre 0 e o valor imediatamente anterior ao inteiro lido.\n\n*Exemplo*\n\nVocê digita:\n```\n5\n```\n\nPrograma imprime:\n```\n0\n1\n2\n3\n4\n```",
  "ex2": "---\n## Exercício 2 — Contador B\n\nSeu jogo foi um sucesso e professora perdiu outra versão.\n- Seu programa deve ler um valor inteiro positivo e imprimir, um por linha, os valores entre 1 e o inteiro lido, inclusive.\n\n*Exemplo*\n\nVocê digita:\n```\n1\n```\n\nPrograma imprime:\n```\n1\n```\n\n*Exemplo*\n\nVocê digita:\n```\n33\n```\n\nPrograma imprime:\n```\n1\n2\n3\n4\n5\n6\n7\n8\n9\n10\n11\n12\n13\n14\n15\n16\n17\n18\n19\n20\n21\n22\n23\n24\n25\n26\n27\n28\n29\n30\n31\n32\n33\n```",
  "ex3": "---\n## Exercício 3 — Contador C\n\nDepois do sucesso dos jogos anteriores, a professora pediu outra versão.\n- Agora seu programa deve ler um valor inteiro positivo e imprimir, um por linha, os valores pares entre 0 e o inteiro lido, inclusive.\n\n*Exemplo*\n\nVocê digita:\n```\n20\n```\n\nPrograma imprime:\n```\n0\n2\n4\n6\n8\n10\n12\n14\n16\n18\n20\n```\n",
  "ex4": "---\n## Exercício 4 — Valores da tabuada entre 1 e 11\n\nSâo muitas as crianças do Ensino Fundamental que foram prejudicadas com a falta de escola presencial durante a pandemia. Para ajudar, você quer fazer um programa que gera tabuadas para elas treinarem.\n\n- Dado um número entre 1 e 11, imprimir os valores da tabulada para multiplicações de 1 a 11\n\n*Exemplo*\n\nVocê digita:\n```\n7\n```\n\nPrograma imprime:\n```\n7\n14\n21\n28\n35\n42\n49\n56\n63\n70\n77\n```",
  "ex5": "---\n## Exercício 5 — Tabuada Tabulada (OBRIGATÓRIO)\n\nTodo mundo gostou do seu programa que imprime os valores da tabuada, mas as crianças pediram uma saída como mais informações, e lhe deram um exemplo.\n\n*Exemplo*\n\nVocê digita:\n```\n5\n```\n\nPrograma imprime:\n```\nTabuada do 5\n5 x 1 = 5\n5 x 2 = 10\n5 x 3 = 15\n5 x 4 = 20\n5 x 5 = 25\n5 x 6 = 30\n5 x 7 = 35\n5 x 8 = 40\n5 x 9 = 45\n5 x 10 = 50\n5 x 11 = 55\n```",
  "ex6": "---\n## Exercício 6 — Tabuada Flex\n\nQue delícia que é pode ajudar as crianças! Elas querem mais e mostram o que querem!\n\nElas fornecem três linhas e deram exemplos de como querem que seu programa informe a saída para eles estudarem :\n- primeira linha: numero do qual queremos calcular a tabuada (valor entre 1 e 99)\n- segunda linha: primeiro valor da tabuada a ser gerado (valor entre 1 e 999)\n- terceira linha: último valor da tabuada a ser gerado (valor entre 1 e 999)\n\n*Exemplo*\n\nVocê digita:\n\n```\n9\n7\n18\n```\n\nPrograma imprime:\n```\nTabuada do 9 de 7 até 18\n9 x 7 = 63\n9 x 8 = 72\n9 x 9 = 81\n9 x 10 = 90\n9 x 11 = 99\n9 x 12 = 108\n9 x 13 = 117\n9 x 14 = 126\n9 x 15 = 135\n9 x 16 = 144\n9 x 17 = 153\n9 x 18 = 162\n```",
  "ex7": "---\n## Exercício 7 — Meio Ambiente: Quantos valores superam a pior estimativa? (OBRIGATÓRIO)\n\nPara ajudar quem monitora o desmatamento na Amazônia, seu programa deve identificar quantas taxas informadas *superam* a pior estimativa definida pelas autoridades.\n\n*Entrada*\n\n- Primeira linha: a pior estimativa (número real).\n- Segunda linha: N, o número de valores a serem processados (inteiro).\n- Próximas N linhas: as taxas observadas (números reais).\n\n*Saída*\n- Um único inteiro: a quantidade de taxas estritamente maiores que a pior estimativa.\n\n*Exemplo*\n\nVocê digita:\n```\n10.3\n4\n11.2\n10.9\n11.0\n10.3\n```\n\nPrograma imprime:\n```\n3\n```",
  "ex8": "---\n## Exercício 8 — Conexões da Turma (matriz identidade) (OBRIGATÓRIO)\n\nNo sistema de controle de presenças que a professora está fazendo, a configuração mais restritiva de acesso define que cada usuária só pode visualizar o *próprio* perfil.  \n- Represente essa configuração como uma matriz `N × N` em que `1` significa \"tem permissão\" e `0` significa \"não tem permissão\".\n- Assim, na configuração mais restritiva, a matriz de permissões corresponde à Matriz Identidade.\n\n*Exemplo*\n\nVocê digita:\n```\n4\n```\n\nPrograma imprime:\n```\n1 0 0 0\n0 1 0 0\n0 0 1 0\n0 0 0 1\n```\n",
  "ex9": "---\n## Exercício 9 — Desenhando...\n\nDesenhar é legal. Programar é legal. Desenhar programando é mais legal ainda.\n-  Dado um inteiro `N`, imprima uma grade `N×N` de símbolos com *um espaço* entre eles. Nas duas diagonais, você imprime `+`; nas demais posições você imprime `*`\n\n*Exemplo*\n\nVocê digita:\n```\n7\n```\n\nPrograma imprime:\n```\n+ * * * * * +\n* + * * * + *\n* * + * + * *\n* * * + * * *\n* * + * + * *\n* + * * * + *\n+ * * * * * +\n```",
  "ex10": "---\n## Exercício 10 — Doações\n\nA ONG que cuida de animais perto de sua casa estará fazendo uma feira de apresentação de animais que precisam de tutores. Nem todo mundo consegue adotar um bicho carente, mas consegue fazer doações em moedas. E você pode ajudar fazendo um programa que conte o valor recebido.\n- Dado o número de moedas e o valor de cada moeda, informe o valor recebido.\n\n*Exemplo*\n\nVocê digita:\n```\n10\n0.50\n0.25\n1.00\n0.25\n1.00\n0.25\n1.00\n0.25\n1.00\n0.25\n```\n\nPrograma imprime:\n```\n5.75\n```",
  "ex11": "---\n## Exercício 11 — Beneficiários do Bolsa Família gastaram R$ 3 bi em bets em agosto/2024 (OBRIGATÓRIO)\n\n> ---\n\n> \"Parte dos recursos dos programas sociais está indo parar nas casas de apostas. Segundo nota técnica elaborada pelo Banco Central (BC), os beneficiários do Bolsa Família gastaram R$ 3 bilhões em bets (empresas de apostas eletrônicas) via Pix em agosto.\" ...\n\n> \"... Segundo a análise técnica do BC, cerca de 5 milhões de beneficiários de um total aproximado de 20 milhões fizeram apostas via Pix. O gasto médio ficou em R\\$ 100. Dos 5 milhões de apostadores, 70% são chefes de família e enviaram, apenas em agosto, R\\$ 2 bilhões às bets (67% do total de R\\$ 3 bilhões).\"\n\n> fonte:  https://agenciabrasil.ebc.com.br/economia/noticia/2024-09/beneficiarios-do-bolsa-familia-gastaram-r-3-bi-em-bets-em-agosto\n\n> ---\n\n- Dado um número de apostas realizadas por uma pessoa e o valor de cada uma, informe quanto a pessoa gastou com 'bets'\n\n*Exemplo*\n\nVocê digita:\n```\n10\n10.00\n5.00\n15.00\n10.00\n5.00\n10.00\n15.00\n10.00\n15.00\n5.00\n```\n\nPrograma imprime:\n```\n100.00\n```",
  "ex12": "---\n## Exercício 12 — Ações contra a evasão\n\nFazemos o máximo que podemos para que **nenhuma** aluna desista de nosso curso, principalmente buscando oferecer o maior número de monitorias **e** nos horários de maior demanda. Também precisamos **monitorar semanalmente** o número de faltas nas aulas e nas monitorias para tentar reduzir evasão.\n\n- Dado o número de semanas a analisar até um determinado momento e o número de faltas a cada semana, informe o total de faltas e a semana com maior número de faltas. Considere que o primeiro valor de faltas informado corresponde à semana número 1 e assim por diante, e que o menor número possível de faltas é 0. Em caso de empate no maior número de faltas, reporte a *primeira* semana que atingiu esse valor.\n\n*Exemplo*\n\nVocê digita:\n```\n6\n10\n15\n15\n12\n8\n2\n```\n\nPrograma imprime:\n```\ntotal 62\nmaior semana 2\n```"
}