{
  "ex1": "---\n## Fila com senha #1\nVocê está em um local onde todo mundo está esperando para ser atendido. O local é organizado e todo mundo tem uma senha em papel.\n\nVocê sabe que a chamada, mostrada em um grande painel, é feita em ordem crescente no número da senha para respeitar a ordem de chegada com uma fila...\n\n- Dada uma linha com o número mostrado no painel, calcule qual o próximo a ser chamado.\n\n*Exemplo*\n```\nEntrada digitada:\n239\n\nPrograma imprime:\n240\n```",
  "ex2": "---\n## Fila com senha #2\nNa mesma fila controlada por senhas, você está segurando o papel com seu número e está alerta para quando será a sua vez...\n\n- Dada uma linha com número da sua senha, calcule qual o número que vai estar no painel imediatamente antes de você ser chamada.\n\n*Exemplo*\n```\nEntrada digitada:\n121\n\nPrograma imprime:\n120\n```",
  "ex3": "---\n## Fila com senha #3\nNa mesma fila controlada por senhas, você está segurando o papel com seu número e quer saber quantos faltam para a sua vez... você vê no painel um número anterior ao seu....\n\n- Dada uma linha com o número mostrado no painel, e o número da sua senha em outra linha, calcule quantos faltam para a sua vez\n\n*Exemplo*\n```\nEntrada digitada:\n237\n241\n\nPrograma imprime:\n4\n```",
  "ex4": "---\n## Vacinação em dobro\n\nNo posto de saúde, onde as pessoas aguardam sua vez, há um cartaz incentivando:\n\n> \"Ajudem-nos a vacinar hoje o dobro de pessoas que vacinamos ontem\"\n\nVocê também quer ajudar....\n- Dada uma linha com o número de vacinas aplicadas ontem, calcule a meta de vacinas a serem aplicadas hoje.\n\n*Exemplo*\n```\nEntrada digitada:\n71\n\nPrograma imprime:\n142\n```",
  "ex5": "---\n## Vacinação da semana\nO posto de saúde perto da sua casa faz vacinações de segunda a sábado.\n- Dada uma linha como o números de vacinas aplicadas em cada um dos seis dias da semana passada, calcule o total de vacinas aplicadas.\n\n*Exemplo*\n```\nEntrada digitada:\n101\n112\n123\n134\n145\n156\n\nPrograma imprime:\n771\n```\n",
  "ex6": "---\n## Presente?\n\nNa chamada da sua escola, uma professora fala seu nome completo, juntando primeiro nome, nome do meio, e sobrenome. Já outra professora chama apenas seu primeiro nome e o sobrenome.\n\n- Dadas três linhas contendo respectivamente seu nome, nome do meio e sobrenome, imprima duas linhas correspondentes a como cada uma das suas duas professoras fazem.\n\n*Exemplo*\n```\nEntrada digitada:\nMaria\nCampos\nPimentel\n\nPrograma imprime:\nMaria Campos Pimentel\nMaria Pimentel\n```",
  "ex7": "---\n## Calculadora particular\nEm várias situações do dia a dia precisamos fazer contas rápidas, por exemplo para calcular o placar de um jogo, o troco do supermercado, ou mesmo determinar o consumo de energia de aparelhos elétricos.\n\nDado dois números inteiros, você deve calcular e mostrar:  \n- a soma  \n- a subtração  \n- a multiplicação  \n- a potência (primeiro número elevado ao segundo)  \n- a divisão inteira  \n- o resto da divisão inteira  \n- a divisão com casas decimais, mostrando apenas uma casa decimal.\n\nVocê pode assumir que nunca será dado um valor nulo no denominador, ok?\n\n*Exemplo*\n```\nEntrada digitada:\n5\n3\n\nPrograma imprime:\n8\n2\n15\n125\n1\n2\n1.7\n```\n---\n*Para imprimir `x` com uma casa decimal com arredondamento, você pode utilizar*\n```python\nprint('%.1f' % x)\n```\n---",
  "ex8": "---\n## Feliz Aniversário!\nTodo mundo sabe que no aniversário sempre vem aquela pergunta: \"Quantos anos você faz agora?\"\n\nDados:\n- o nome de uma pessoa na primeira linha\n- sua idade atual  na segunda linha (número inteiro)\n\nCalcule a idade após o próximo aniversário e imprima uma mensagem personalizada, como:\n\n*Parabéns [nome]! Você completou [nova idade] anos!*\n\n> NOTA: montar a saída exatamente desse jeito pode parecer \"pegadinha\", mas vale à pena tentar e mostrar quem manda! ;-)\n\n*Exemplo*\n```\nEntrada digitada:\nGraça\n64\n\nPrograma imprime:\nParabéns Graça! Você completou 65 anos!\n```",
  "ex9": "---\n## Chego em 91 minutos....\nQuando alguém diz: \"Chego em 91 minutos\", imediatamente pensamos que o valor equivale a 1 hora e 31 minutos\n\n- Dado um número inteiro representando minutos, calcule o valor de horas e minutos, e imprima os dois valores linhas separadas\n\n*Exemplo*\n```\nEntrada digitada:\n91\n\nPrograma imprime:\n1\n31\n```",
  "ex10": "---\n## Dados para uma compra consciente\nÉ fundamental nunca gastar mais do que você tem. Neste exercício, você verificará se uma compra cabe no seu orçamento.\n\n- Dadas uma linha com o valor que você tem e outra o valor de um item que pode ser adquirido, calcule e mostre qual será valor restante caso a compra seja realizada.\n\nUtilize\n- `float()` para ler o valor em reais com duas casas decimais\n- `print('%.2f' % x)` para imprimir o valor de x com duas casas decimais\n\n*Exemplo*\n```\nEntrada digitada:\n50.00\n15.99\n\nPrograma imprime:\n34.01\n```\n\n*Exemplo*\n```\nEntrada digitada:\n10.00\n15.99\n\nPrograma imprime:\n-5.99\n```"
}
